<?php

// if文を活用して条件分岐
// ショートビッグ5テスト
// 性格分析
// 好奇心開放性
// 誠実生 
// 外交せい
// 協調性
// 神経症傾向

// 質問内容当（あてまらない0〜4当てはまる）
// 1.初対面の人と会うのが好きで会話をするのが好きか？
// 2.他人に思いやりがある。差別せずに行動をうつしているか？
// 3.きっちり物事をこなして、効率よく手際良く行う方ですか？
// 4.いつも心配事が多くて不安になりやすい
// 5.自分は何か新しいことをするのが好き。クリエイティビティが強いか？
// 6.自分は恥ずかしがり屋で物静かなタイプだ
// 7.思ったことをすぐ口に出す。他人に同情をすることがあまりない
// 8.あまり後先考えずに行動して、ギリギリまで手をつけない人間だ
// 9.大抵はリラックスしていて平穏である
// 10.現実的なタイプ。保守的なことが好き。常識的で妄想しない。

// 計算方法
// 1~5はそのまま
// 6~10の点数は反転

// 診断方法
// 外向性：1の質問点数＋6の点数を反転したもの
// 協調性：2の質問点数＋7の点数を反転したもの
// 誠実生：3の質問点数＋8の点数を反転したもの
// 神経症的傾向：4の質問点数＋9の点数を反転したもの
// 開放性：5の質問点数＋10の点数を反転したもの
// 低い0〜4、高い5~8





?>
